# Concat

## Description
Function Concat combines, or concatenates, all the specified parameters in order and returns the resultant string.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION Concat(txt : DYNARRAY[] of CHAR) : DYNARRAY[] of CHAR;
```

```python

def vs.Concat(txt):
    return DYNARRAY[] of CHAR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|txt|DYNARRAY[] of CHAR||

## Examples
```pascal
newStr:=Concat('A','sample','string');
```

## Version
Availability: from MiniCAD
## Category
* Strings